## MySQLClient

In [1]:
!pip install --user mysqlclient

Collecting mysqlclient
  Downloading mysqlclient-2.2.4-cp39-cp39-win_amd64.whl (203 kB)
Installing collected packages: mysqlclient
Successfully installed mysqlclient-2.2.4

In [2]:
%load_ext sql

In [3]:
%sql mysql+mysqldb://root:@127.0.0.1:3306/hr

In [4]:
%sql SELECT * FROM employees

 * mysql+mysqldb://root:***@127.0.0.1:3306/hr
10 rows affected.

[('E1001', 'John', 'Thomas', '123456', datetime.date(1976, 9, 1), 'M', '5631 Rice, OakPark,IL', '100', Decimal('110000.00'), '30001', '2'),
 ('E1002', 'Alice', 'James', '123457', datetime.date(1972, 7, 31), 'F', '980 Berry ln, Elgin,IL', '200', Decimal('80000.00'), '30002', '5'),
 ('E1003', 'Steve', 'Wells', '123458', datetime.date(1980, 10, 8), 'M', '291 Springs, Gary,IL', '300', Decimal('50000.00'), '30002', '5'),
 ('E1004', 'Santosh', 'Kumar', '123459', datetime.date(1985, 7, 20), 'M', '511 Aurora Av, Aurora,IL', '400', Decimal('60000.00'), '30004', '5'),
 ('E1005', 'Ahmed', 'Hussain', '123410', datetime.date(1981, 4, 1), 'M', '216 Oak Tree, Geneva,IL', '500', Decimal('70000.00'), '30001', '2'),
 ('E1006', 'Nancy', 'Allen', '123411', datetime.date(1978, 6, 2), 'F', '111 Green Pl, Elgin,IL', '600', Decimal('90000.00'), '30001', '2'),
 ('E1007', 'Mary', 'Thomas', '123412', datetime.date(1975, 5, 5), 'F', '100 Rose Pl, Gary,IL', '650', Decimal('65000.00'), '30003', '7'),
 ('E1008', 'Bharath', 'Gupta', '123413', datetime.date(1985, 6, 5), 'M', '145 Berry Ln, Naperville,IL', '660', Decimal('65000.00'), '30003', '7'),
 ('E1009', 'Andrea', 'Jones', '123414', datetime.date(1990, 9, 7), 'F', '120 Fall Creek, Gary,IL', '234', Decimal('70000.00'), '30003', '7'),
 ('E1010', 'Ann', 'Jacob', '123415', datetime.date(1982, 3, 30), 'F', '111 Britany Springs,Elgin,IL', '220', Decimal('70000.00'), '30004', '5')]